[2J[001;001H[=3h[2J[001;001H[2J[001;001H[8;056;240t[2J[001;001H[2J[001;001H[=3h[2J[001;001H[2J[001;001H[8;056;240t[2J[001;001HKernel compiled without mitigations, ignoring 'mitigations'; system may still be vulnerable
RDSEED32 is broken. Disabling the corresponding CPUID bit.
Kernel version: 6.19.0-ktest-c8593b01cc-20260608
hook init_noop

Running tests mgs-setup

========= TEST   mgs-setup
/host/home/ktest/git/lustre-release/lustre/tests/test-framework.sh: line 6894: cd: HOME not set
MGS_OS_VERSION_ID=24.04
MGS_OS_ID=ubuntu
MGS_OS_VERSION_CODE=402915328
MGS_OS_ID_LIKE=debian ubuntu
MDS1_OS_ID=ubuntu
MDS1_OS_VERSION_CODE=402915328
MDS1_OS_ID_LIKE=debian ubuntu
MDS1_OS_VERSION_ID=24.04
OST1_OS_VERSION_ID=24.04
OST1_OS_VERSION_CODE=402915328
OST1_OS_ID=ubuntu
OST1_OS_ID_LIKE=debian ubuntu
CLIENT_OS_VERSION_ID=24.04
CLIENT_OS_ID_LIKE=debian ubuntu
CLIENT_OS_ID=ubuntu
CLIENT_OS_VERSION_CODE=402915328
Loading modules from /host/home/ktest/git/lustre-release/lustre
detected 16 online CPUs by sysfs
MODOPTS_LIBCFS=
libcfs will create CPU partition based on online CPUs
libcfs: loading out-of-tree module taints kernel.
BPF: 	(invalid-name-offset) type_id=65 bits_offset=0
BPF:  
BPF: Invalid member name_offset:27023
BPF: 
failed to validate module [libcfs] BTF: -22
modprobe: ERROR: could not insert 'libcfs': Invalid argument
error: set_param: param_path 'debug': No such file or directory
error: set_param: setting 'debug'='neterror net nettrace malloc': No such file or directory
error: set_param: param_path 'subsystem_debug': No such file or directory
error: set_param: setting 'subsystem_debug'='all': No such file or directory
BPF: 	(invalid-name-offset) type_id=65 bits_offset=0
BPF:  
BPF: Invalid member name_offset:27023
BPF: 
failed to validate module [libcfs] BTF: -22
modprobe: ERROR: could not insert 'lnet': Invalid argument
BPF: 	(invalid-name-offset) type_id=65 bits_offset=0
BPF:  
BPF: Invalid member name_offset:27023
BPF: 
failed to validate module [libcfs] BTF: -22
modprobe: ERROR: could not insert 'ksocklnd': Invalid argument
BPF: 	(invalid-name-offset) type_id=65 bits_offset=0
BPF:  
BPF: Invalid member name_offset:27023
BPF: 
failed to validate module [libcfs] BTF: -22
modprobe: ERROR: could not insert 'obdclass': Invalid argument
BPF: 	(invalid-name-offset) type_id=65 bits_offset=0
BPF:  
BPF: Invalid member name_offset:27023
BPF: 
failed to validate module [libcfs] BTF: -22
modprobe: ERROR: could not insert 'ptlrpc': Invalid argument
gss/krb5 is not supported
BPF: 	(invalid-name-offset) type_id=65 bits_offset=0
BPF:  
BPF: Invalid member name_offset:27023
BPF: 
failed to validate module [libcfs] BTF: -22
modprobe: ERROR: could not insert 'fld': Invalid argument
BPF: 	(invalid-name-offset) type_id=65 bits_offset=0
BPF:  
BPF: Invalid member name_offset:27023
BPF: 
failed to validate module [libcfs] BTF: -22
modprobe: ERROR: could not insert 'fid': Invalid argument
BPF: [3] Invalid name_offset:2532439
failed to validate module [ec] BTF: -22
modprobe: ERROR: could not insert 'ec': Invalid argument
BPF: 	(invalid-name-offset) type_id=65 bits_offset=0
BPF:  
BPF: Invalid member name_offset:27023
BPF: 
failed to validate module [libcfs] BTF: -22
modprobe: ERROR: could not insert 'lmv': Invalid argument
BPF: 	(invalid-name-offset) type_id=65 bits_offset=0
BPF:  
BPF: Invalid member name_offset:27023
BPF: 
failed to validate module [libcfs] BTF: -22
modprobe: ERROR: could not insert 'osc': Invalid argument
BPF: 	(invalid-name-offset) type_id=65 bits_offset=0
BPF:  
BPF: Invalid member name_offset:27023
BPF: 
failed to validate module [libcfs] BTF: -22
modprobe: ERROR: could not insert 'lov': Invalid argument
BPF: 	(invalid-name-offset) type_id=65 bits_offset=0
BPF:  
BPF: Invalid member name_offset:27023
BPF: 
failed to validate module [libcfs] BTF: -22
modprobe: ERROR: could not insert 'mdc': Invalid argument
BPF: 	(invalid-name-offset) type_id=65 bits_offset=0
BPF:  
BPF: Invalid member name_offset:27023
BPF: 
failed to validate module [libcfs] BTF: -22
modprobe: ERROR: could not insert 'mgc': Invalid argument
BPF: 	(invalid-name-offset) type_id=65 bits_offset=0
BPF:  
BPF: Invalid member name_offset:27023
BPF: 
failed to validate module [libcfs] BTF: -22
modprobe: ERROR: could not insert 'obdecho': Invalid argument
BPF: 	(invalid-name-offset) type_id=65 bits_offset=0
BPF:  
BPF: Invalid member name_offset:27023
BPF: 
failed to validate module [libcfs] BTF: -22
modprobe: ERROR: could not insert 'lustre': Invalid argument
[1mMounting separate MGS...[0m
BPF: 	(invalid-name-offset) type_id=65 bits_offset=0
BPF:  
BPF: Invalid member name_offset:27023
BPF: 
failed to validate module [libcfs] BTF: -22
[31mFAIL[0m with [31mMount failed after 1 attempts: -19 ENODEV (No such device)[0m
[1mUnmount of client...[0m
[31mFAIL[0m with [31mMount point /mnt/lustre does not exist[0m

========= PASSED mgs-setup in 18s

Passed: mgs-setup
Failed: 
NOTICE: Automounting of tracing to debugfs is deprecated and will be removed in 2030
Kernel version: 6.19.0-ktest-c8593b01cc-20260608
TEST SUCCESS
sysrq: Power Off
