[2J[001;001H[=3h[2J[001;001H[2J[001;001H[8;056;240t[2J[001;001H[2J[001;001H[=3h[2J[001;001H[2J[001;001H[8;056;240t[2J[001;001HKernel compiled without mitigations, ignoring 'mitigations'; system may still be vulnerable
RDSEED32 is broken. Disabling the corresponding CPUID bit.
Kernel version: 6.19.0-ktest-c8593b01cc-20260608
hook init_noop

Running tests llmount

========= TEST   llmount
SETUP LUSTRE ... libcfs: loading out-of-tree module taints kernel.
BPF: 	(invalid-name-offset) type_id=65 bits_offset=0
BPF:  
BPF: Invalid member name_offset:27023
BPF: 
failed to validate module [libcfs] BTF: -22
BPF: 	(invalid-name-offset) type_id=65 bits_offset=0
BPF:  
BPF: Invalid member name_offset:27023
BPF: 
failed to validate module [libcfs] BTF: -22
BPF: 	(invalid-name-offset) type_id=65 bits_offset=0
BPF:  
BPF: Invalid member name_offset:27023
BPF: 
failed to validate module [libcfs] BTF: -22
BPF: 	(invalid-name-offset) type_id=65 bits_offset=0
BPF:  
BPF: Invalid member name_offset:27023
BPF: 
failed to validate module [libcfs] BTF: -22
BPF: 	(invalid-name-offset) type_id=65 bits_offset=0
BPF:  
BPF: Invalid member name_offset:27023
BPF: 
failed to validate module [libcfs] BTF: -22
BPF: 	(invalid-name-offset) type_id=65 bits_offset=0
BPF:  
BPF: Invalid member name_offset:27023
BPF: 
failed to validate module [libcfs] BTF: -22
BPF: 	(invalid-name-offset) type_id=65 bits_offset=0
BPF:  
BPF: Invalid member name_offset:27023
BPF: 
failed to validate module [libcfs] BTF: -22
BPF: [3] Invalid name_offset:2532439
failed to validate module [ec] BTF: -22
BPF: 	(invalid-name-offset) type_id=65 bits_offset=0
BPF:  
BPF: Invalid member name_offset:27023
BPF: 
failed to validate module [libcfs] BTF: -22
BPF: 	(invalid-name-offset) type_id=65 bits_offset=0
BPF:  
BPF: Invalid member name_offset:27023
BPF: 
failed to validate module [libcfs] BTF: -22
BPF: 	(invalid-name-offset) type_id=65 bits_offset=0
BPF:  
BPF: Invalid member name_offset:27023
BPF: 
failed to validate module [libcfs] BTF: -22
BPF: 	(invalid-name-offset) type_id=65 bits_offset=0
BPF:  
BPF: Invalid member name_offset:27023
BPF: 
failed to validate module [libcfs] BTF: -22
BPF: 	(invalid-name-offset) type_id=65 bits_offset=0
BPF:  
BPF: Invalid member name_offset:27023
BPF: 
failed to validate module [libcfs] BTF: -22
BPF: 	(invalid-name-offset) type_id=65 bits_offset=0
BPF:  
BPF: Invalid member name_offset:27023
BPF: 
failed to validate module [libcfs] BTF: -22
BPF: 	(invalid-name-offset) type_id=65 bits_offset=0
BPF:  
BPF: Invalid member name_offset:27023
BPF: 
failed to validate module [libcfs] BTF: -22
BPF: 	(invalid-name-offset) type_id=65 bits_offset=0
BPF:  
BPF: Invalid member name_offset:27023
BPF: 
failed to validate module [libcfs] BTF: -22
BPF: 	(invalid-name-offset) type_id=65 bits_offset=0
BPF:  
BPF: Invalid member name_offset:27023
BPF: 
failed to validate module [libcfs] BTF: -22
BPF: 	(invalid-name-offset) type_id=65 bits_offset=0
BPF:  
BPF: Invalid member name_offset:27023
BPF: 
failed to validate module [libcfs] BTF: -22
BPF: 	(invalid-name-offset) type_id=65 bits_offset=0
BPF:  
BPF: Invalid member name_offset:27023
BPF: 
failed to validate module [libcfs] BTF: -22
BPF: 	(invalid-name-offset) type_id=65 bits_offset=0
BPF:  
BPF: Invalid member name_offset:27023
BPF: 
failed to validate module [libcfs] BTF: -22
Error 2 at /host/home/ktest/ktest/tests/../lib/common.sh 105 from: ( set -e; "$@" ) > "$out" 2>&1, exiting

FSTYPE=wbcfs
FSNAME=
MGSNID=
TESTSUITE=
ONLY=
/host/home/ktest/git/lustre-release/lustre/tests/test-framework.sh: line 6894: cd: HOME not set
MGS_OS_VERSION_ID=24.04
MGS_OS_ID=ubuntu
MGS_OS_VERSION_CODE=402915328
MGS_OS_ID_LIKE=debian ubuntu
MDS1_OS_ID=ubuntu
MDS1_OS_VERSION_CODE=402915328
MDS1_OS_ID_LIKE=debian ubuntu
MDS1_OS_VERSION_ID=24.04
OST1_OS_VERSION_ID=24.04
OST1_OS_VERSION_CODE=402915328
OST1_OS_ID=ubuntu
OST1_OS_ID_LIKE=debian ubuntu
CLIENT_OS_VERSION_ID=24.04
CLIENT_OS_ID_LIKE=debian ubuntu
CLIENT_OS_ID=ubuntu
CLIENT_OS_VERSION_CODE=402915328
Loading modules from /host/home/ktest/git/lustre-release/lustre
detected 16 online CPUs by sysfs
MODOPTS_LIBCFS=
libcfs will create CPU partition based on online CPUs
modprobe: ERROR: could not insert 'libcfs': Invalid argument
error: set_param: param_path 'debug': No such file or directory
error: set_param: setting 'debug'='neterror net nettrace malloc': No such file or directory
error: set_param: param_path 'subsystem_debug': No such file or directory
error: set_param: setting 'subsystem_debug'='all': No such file or directory
modprobe: ERROR: could not insert 'lnet': Invalid argument
modprobe: ERROR: could not insert 'ksocklnd': Invalid argument
modprobe: ERROR: could not insert 'obdclass': Invalid argument
modprobe: ERROR: could not insert 'ptlrpc': Invalid argument
gss/krb5 is not supported
modprobe: ERROR: could not insert 'fld': Invalid argument
modprobe: ERROR: could not insert 'fid': Invalid argument
modprobe: ERROR: could not insert 'ec': Invalid argument
modprobe: ERROR: could not insert 'lmv': Invalid argument
modprobe: ERROR: could not insert 'osc': Invalid argument
modprobe: ERROR: could not insert 'lov': Invalid argument
modprobe: ERROR: could not insert 'mdc': Invalid argument
modprobe: ERROR: could not insert 'mgc': Invalid argument
modprobe: ERROR: could not insert 'obdecho': Invalid argument
modprobe: ERROR: could not insert 'lustre': Invalid argument
Mount combined MGS/MDS...
FAIL with Mount failed after 1 attempts: -19 ENODEV (No such device)
Mounting MDT lustre-MDT0001...
FAIL with Mount failed after 1 attempts: -19 ENODEV (No such device)
Mounting OST lustre-OST0000...
FAIL with Mount failed after 1 attempts: -19 ENODEV (No such device)
Mounting OST lustre-OST0001...
FAIL with Mount failed after 1 attempts: -19 ENODEV (No such device)
Mounting Lustre client 0@lo:/lustre...
FAIL with Mount failed after 1 attempts: -19 ENODEV (No such device)
error: set_param: param_path 'mdt/*/identity_upcall': No such file or directory
error: set_param: setting 'mdt/*/identity_upcall'='NONE': No such file or directory
Error 2 at /host/home/ktest/ktest/tests/fs/lustre/lustre-libs.sh 312 from: "$LCTL" set_param mdt.*.identity_upcall=NONE, exiting
Error 1 at /host/home/ktest/ktest/tests/prelude.sh 367 from: ( set -e; run_test $i ), exiting

========= FAILED llmount in 14s

Passed: 
Failed: llmount
Error 1 at /host/home/ktest/ktest/tests/prelude.sh 474 from: return ${#tests_failed[@]}, exiting
Error 1 at /host//home/ktest/ktest/tests/fs/lustre/llmount.ktest 33 from: return ${#tests_failed[@]}, exiting
NOTICE: Automounting of tracing to debugfs is deprecated and will be removed in 2030
Kernel version: 6.19.0-ktest-c8593b01cc-20260608
TEST FAILED
sysrq: Power Off
